## Module 4: Cleaning data with pandas
## Weekly Assignment 4B
### Brandan Owens and Loan Pham

### Q.1 Download the dataset "adult_income_data.csv"

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
# (a) read in the dataset with pd.read_csv. Show the first 8 records, what’s wrong with the process of importing the dataset.
ad = pd.read_csv("../dataFiles/adult_income_data.csv")
ad.head(8)

FileNotFoundError: [Errno 2] No such file or directory: 'adult_income_data.csv'

In [166]:
# (b) read the dataset again and bear in mind that the dataset has no header (use header = None).
ad = pd.read_csv("../dataFiles/adult_income_data.csv", header = None)
ad.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

In [170]:
# (c) name the columns. Refer to the "adult_income_names.txt"

#header_names = ['age','workclass', 'fnlwgt','education','education-num',
                  # 'marital-status','occupation','relationship','sex','capital-gain','capital-loss',
                  # 'hours-per-week','native-country','wage_category']
#ad1 = pd.read_csv("adult_income_data.csv", header = None, skiprows = 1, names = header_names)

names=[]
with open("../dataFiles/adult_income_names.txt","r") as f:
    for line in f:
        f.readline()
        var = line.split(":")[0]
        names.append(var)
names
ad1.columns = names
ad1.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,wage_category
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,Female,0,0,40,United-States,<=50K

In [118]:
# (d) get the statistical summary of the dataset.
ad1.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32560.000000,3.256000e+04,32560.000000,32560.000000,32560.000000,32560.000000
mean,38.581634,1.897818e+05,10.080590,1077.615172,87.306511,40.437469
std,13.640642,1.055498e+05,2.572709,7385.402999,402.966116,12.347618
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178315e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783630e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370545e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [158]:
# (e) Create a DataFrame with only age, education, and occupation

ad2 = ad1[['age','education','occupation']]
ad2.head()

     age   education        occupation
7     31     Masters    Prof-specialty
8     42   Bachelors   Exec-managerial
83    44     HS-grad      Craft-repair
100   44   Bachelors   Exec-managerial
104   32     HS-grad      Craft-repair

In [159]:
# (g) Find the number of people who are aged between 30 and 50

ad2 = ad2[ad1['age'].between(30, 50)]
ad2.head()

     age   education        occupation
7     31     Masters    Prof-specialty
8     42   Bachelors   Exec-managerial
83    44     HS-grad      Craft-repair
100   44   Bachelors   Exec-managerial
104   32     HS-grad      Craft-repair

In [162]:
# (h) Find the number of people who are aged between 30 and 50, and made positive capital gain.

ad3 = ad1[['age','education','occupation','capital-gain']]
ad3 = ad3[(ad1['age'] >= 30) & (ad3['age'] <= 50)  & (ad3['capital-gain'] > 0)]
ad3.head()

     age   education        occupation  capital-gain
7     31     Masters    Prof-specialty         14084
8     42   Bachelors   Exec-managerial          5178
83    44     HS-grad      Craft-repair         14344
100   44   Bachelors   Exec-managerial         15024
104   32     HS-grad      Craft-repair          7688

In [164]:
# (i)  group by "occupation", show the median age of each group.

grouped = ad2.groupby('occupation')['age'].median()
grouped

occupation
 ?                    36.0
 Adm-clerical         40.0
 Craft-repair         40.0
 Exec-managerial      41.0
 Farming-fishing      41.0
 Handlers-cleaners    38.0
 Machine-op-inspct    40.0
 Other-service        39.0
 Priv-house-serv      45.5
 Prof-specialty       41.0
 Protective-serv      37.0
 Sales                40.0
 Tech-support         40.0
 Transport-moving     41.0
Name: age, dtype: float64

In [153]:
# (j)  use the following codes to create two dataframes
df1 = data_income[['age', 'workclass', 'occupation']].sample(5,random_state=101)
df2 = data_income[['education','occupation']].sample(5,random_state=101)

# merge df1 with df2. The key is  'occupation'
# data_income.merge(df1, df2, on="occupation")

NameError: name 'data_income' is not defined

In [3]:
#Q.2.a Read in dataset 'Energy Indicators.xls'. Exclude the footer & header info, the first two columns and change the labels to reflect ['Country','Energy Supply','Energy Supply per Capita','% Renewable']. Be sure to remove everything but the characters in 'Country'. Rename the following countries ["Republic of Korea":"South Korea","United States of America":"United States","United Kingdom of Great Britain and Northern Ireland":"United Kingdom","China, Hong Kong Special Administrative Region":"Hong Kong","Bolivia (Plurinational State of)":"Bolivia","Switzerland17":"Switzerland"].

In [4]:
#Q.2.b Load the GDP Data from "world_bank.xlsx". Exclude the header, rename the following countries ["Korea, Rep.":"South Korea","Iran, Islamic Rep.":"Iran","Hong Kong SAR, China":"Hong Kong"]

In [5]:
#Q.2.c Load the dataset scimagojr.xlsx

In [6]:
#Q.2.d Join the three datasets, retain only the last 10 years of GDP data and only the top 15 countries by Scimagojr 'Rank'

In [7]:
#Q.2.e What is the average GDP over the last 10 years for each country?

In [8]:
#Q.2.f By how much had the GDP changed over the 10-year span for the country with the 6th largest average GDP?

In [ ]:
#Q.2.g Create a new column that is the ration of Self-Citations to Total Citations. What is the maximum value for this new column, and what country has the highest ratio?